import { ChapterModel } from '../chapter.model';

export const chapter5: ChapterModel = {
  description: '<span>У цьому розділі розглядаються завдання складання алгоритмів для машини Тьюринга.</span><span>Наводиться короткий опис цієї машини, на прикладах пояснюються основні прийоми складання таких алгоритмів та пропонуються завдання для самостійного вирішення.</span>',
  id: 5,
  pages: [
    {
      title: 'Короткий опис машини Тьюрінга',
      content: [
        { type: 'text', content: '<span>Машина Тьюринга (МТ) складається з двох частин – стрічки та автомата:</span>'},
        { type: 'image', content: '/assets/chapter-page-imgs/tm-input-automat.png' },
        { type: 'text', content: '<span>Лента використовується для зберігання інформації. Вона безмежна в обидві сторони і поділена на клітинки, для більш зручної навігації під клітинками вказано їх індекс. У кожній клітинці може бути записаний один символ або нічого не записано. Зміст клітинки може змінюватися – в неї можна записати інший символ або стерти той, що там знаходиться.</span>'},
        { type: 'text', content: '<span>Автомат – це активна частина машини Тьюрінга. В кожний момент він розміщується під однією з клітинок стрічки і бачить її вміст; це видима клітинка, а символ, що знаходиться в ній, – видимий символ; вміст сусідніх та інших клітинок автомат не бачить. Крім того, в кожний момент автомат перебуває в одному зі станів, які ми будемо позначати літерою q з номерами: q1, q2 і т.д. Перебуваючи в певному стані, автомат виконує якусь певну операцію.</span>'},
        { type: 'text', content: '<span>Автомат може виконувати три елементарні дії:</span>'},
        { type: 'text', content: '<span>1) записувати у видиму клітинку новий символ (змінювати вміст інших клітинок автомат не може);</span>'},
        { type: 'text', content: '<span>2) зсуватися на одну клітинку вліво або вправо («перестрибувати» відразу через кілька клітинок автомат не може);</span>'},
        { type: 'text', content: '<span>3) переходити в новий стан.</span>'},
        { type: 'text', content: '<span>Нічого іншого робити автомат не вміє, тому всі більш складні операції так чи інакше повинні бути зведені до цих трьох елементарних дій.</span>'},
      ],
    },
    {
      title: 'Написання програми для мишини Тьюрінга',
      content: [
        { type: 'text', content: '<span>Сама по собі машина Тьюрінга нічого не робить. Для того, щоб змусити її працювати, потрібно написати для неї програму. Ця програма записується у вигляді наступної таблиці:</span>'},
        { type: 'image', content: '/assets/chapter-page-imgs/tm-table.png' },
        { type: 'text', content: '<span>Зліва всі символи (включно з порожньою клітинкою для порожнього символу) згори перераховуються всі стани, в яких може перебувати автомат, які автомат може бачити на стрічці. (Які саме символи у таблиці – визначає автор програми.) На перетині (у клітинах таблиці) вказуються ті дії, які повинен виконати автомат, коли він перебуває в відповідному стані і бачить на стрічці відповідний символ.</span>'},
        { type: 'text', content: '<span>В цілому таблиця визначає дії машини Тьюрінга при всіх можливих конфігураціях і тим самим повністю задає поведінку машини Тьюрінга. Описати алгоритм у вигляді машини Тьюрінга – означає представити таку таблицю.</span>'},
        { type: 'text', content: '<span>Перед виконанням програми потрібно записати на стрічку вхідне слово, до якого буде застосована програма. Вхідне слово – це скінченна послідовність символів, записаних у сусідніх клітинках стрічки. Порожнє вхідне слово означає, що всі клітинки стрічки порожні.</span>'},
        { type: 'text', content: '<span>Початок виконання програми виглядає наступним чином - у таблиці знаходиться клітинка на перетині першого стовпця (тому що автомат перебуває у стані Q0) та того ряду, який відповідає першому символу, на який вказує автомат (це не обов\'язково перший ряд таблиці), і виконується команда, вказана у цій клітинці. В результаті автомат опиниться в новій конфігурації. Тепер такі ж дії повторюються, але вже для нової конфігурації: у таблиці знаходиться клітинка, що відповідає стану і символу цієї конфігурації, і виконується такт з цієї клітинки. І так далі.</span>'},
        { type: 'text', content: '<span>Коли завершується виконання програми? Введемо поняття дії зупинки. Для того, щоб задати цю дію в команді, потрібно встановити новий стан програми як "🏁 Finish"."</span>'},
      ],
    },
    {
      title: 'Приклади задач для машини Тьюрінга',
      content: [
        { type: 'text', content: '<span>Розглянемо приклади складання програм для машини Тьюрінга, щоб продемонструвати деякі типові прийоми програмування на машині Тьюрінга. Для скорочення формулювання завдань введемо наступні скорочення:</span>'},
        { type: 'text', content: '<span>1) літерою "W" будемо позначати вхідне слово</span>'},
        { type: 'text', content: '<span>2) літерою "А" будемо позначати алфавіт вхідного слова, тобто набір тих символів, з яких і тільки з яких може складатися W</span>'},
        { type: 'text', content: '<span></span>'},
        { type: 'text', content: '<span>Приклад 1 (переміщення автомата, заміна символів)</span>'},
        { type: 'text', content: '<span>А={0,1,2,3,4,5,6,7,8,9}. Нехай W – непорожнє слово; це означає, що W – це послідовність з десятичних цифр, тобто запис додатного цілого числа в десятковій системі. Потрібно отримати на стрічці запис числа, яке на 1 більше числа W.</span>'},
        { type: 'text', content: '<a href="/emulator/turing-machine?example=1" target="_blank">Посилання на Емулятор МТ</a>'},
      ],
    },
    {
      title: `Задачі для самостійного розв'язання`,
      content: [
        { type: 'text', content: '<span>Зауваження:</span>'},
        { type: 'text', content: '<span>1) У задачах розглядаються лише цілі невід\'ємні числа, якщо не сказано інше.</span>'},
        { type: 'text', content: '<span>2) Під «одиничною» системою числення розуміється запис невід\'ємного цілого числа за допомогою паличок – має бути виписано стільки паличок, яка величина числа; наприклад: 2→ | | , 5 → | | | | | , 0 → <порожнє слово></span>'},
        { type: 'text', content: '<span></span>'},
        { type: 'text', content: '<span><b>1.1</b> A={a,b,c}. Приписати зліва до слова W символ b (W → bW).</span>'},
        { type: 'text', content: '<span><b>1.2</b> A={a,b,c}. Приписати справа до слова W символи bc (W → Wbc).</span>'},
        { type: 'text', content: '<span><b>1.3</b> A={a,b,c}. Замінити на a кожен другий символ у слові W.</span>'},
        { type: 'text', content: '<span><b>1.4</b> A={a,b,c}. Залишити у слові W тільки перший символ (порожнє слово не змінювати).</span>'},
        { type: 'text', content: '<span><b>1.5</b> A={a,b,c}. Залишити у слові W тільки останній символ (порожнє слово не змінювати).</span>'},
        { type: 'text', content: '<span><b>1.6</b> A={a,b,c}. Визначити, чи є W словом ab. Відповідь (вихідне слово): слово ab, якщо є, або порожнє слово інакше.</span>'},
        { type: 'text', content: '<span><b>1.7</b> A={a,b,c}. Визначити, чи входить у слово W символ a. Відповідь: слово з одного символа a (так, входить) або порожнє слово (ні).</span>'},
        { type: 'text', content: '<span><b>1.8</b> A={a,b,c}. Якщо у слово W не входить символ a, то замінити у W всі символи b на c, інакше як відповідь видається слово з одного символа a.</span>'},
        { type: 'text', content: '<span><b>1.9</b> A={a,b,0,1}. Визначити, чи є слово W ідентифікатором (непорожнім словом, що починається з букви). Відповідь: слово a (так) або порожнє слово (ні).</span>'},
        { type: 'text', content: '<span><b>1.10</b> A={a,b,0,1}. Визначити, чи є слово W записом числа в двійковій системі числення (непорожнім словом, що складається тільки з цифр 0 і 1). Відповідь: слово 1 (так) або слово 0.</span>'},
        { type: 'text', content: '<span><b>1.11</b> A={0,1}. Вважаючи непорожнє слово W записом двійкового числа, видалити з нього незначущі нулі, якщо такі є.</span>'},
        { type: 'text', content: '<span><b>1.12</b> A={0,1}. Для непорожнього слова W визначити, чи є воно записом ступеня двійки (1, 2, 4, 8, ...) у двійковій системі числення. Відповідь: слово 1 (так) або слово 0.</span>'},
        { type: 'text', content: '<span><b>1.13</b> A={0,1,2,3}. Вважаючи непорожнє слово W записом числа у чотирьохзначній системі числення, визначити, чи є воно парним числом чи ні. Відповідь: 1 (так) або 0.</span>'},
        { type: 'text', content: '<span><b>1.14</b> A={0,1}. Вважаючи непорожнє слово W записом числа у двійковій системі, отримати двійкове число, рівне учетвереному числу W (наприклад: 101 → 10100).</span>'},
        { type: 'text', content: '<span><b>1.15</b> A={0,1}. Вважаючи непорожнє слово W записом числа у двійковій системі, отримати двійкове число, рівне неповному частці від ділення числа W на 2 (наприклад: 1011 → 101).</span>'},
        { type: 'text', content: '<span><b>1.16</b> A={a,b,c}. Якщо W – слово парної довжини (0, 2, 4, ...), то видати відповідь a, інакше – порожнє слово.</span>'},
        { type: 'text', content: '<span><b>1.17</b> A={0,1,2}. Вважаючи непорожнє слово W записом числа у трійковій системі числення, визначити, чи є воно парним числом чи ні. Відповідь: 1 (так) або 0. (Зауваження: у парному трійковому числі має бути парна кількість цифр 1.)</span>'},
        { type: 'text', content: '<span><b>1.18</b> A={a,b,c}. Якщо W має непарну довжину, залишити у W тільки середній символ.</span>'},
        { type: 'text', content: '<span><b>1.19</b> A={a,b,c}. Якщо слово W має парну довжину, то залишити у ньому тільки ліву половину.</span>'},
        { type: 'text', content: '<span><b>1.20</b> A={a,b,c}. Приписати зліва до непорожнього слова W його перший символ.</span>'},
      ]
    }
  ],
  title: 'Analysis of Algorithms',
  thumbnail: 'turing-machine.webp',
  thumbnailColor: '#091918cc',
}
