import { ChapterModel } from './chapter.model';

export const chapter5: ChapterModel = {
  id: 5,
  title: 'Analysis of Algorithms',
  description: '<span>Ми часто використовуємо слово "алгоритм", щоб позначити ідею або план, який стоїть за комп\'ютерною програмою.</span>\n' +
    '<br>\n' +
    '<span>Алгоритм можна розглядати як послідовність кроків, в якій кожен крок чітко визначений і може бути виконаний механічно протягом певного обмеженого часу.</span>\n' +
    '<span>Алгоритм може мати вхідні дані, і він повинен мати вихідні дані.</span>\n' +
    '<br>\n' +
    '<span>Докладніше теоретичне дослідження алгоритмів вимагає більш формального визначення, такого як поняття <b>машина Т\'юрінга</b>.</span>',
  thumbnail: 'turing-machine.webp',
}
